Autodesk.Revit.DB.IndependentTag.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,System.Double)
Places a tag in a Generic Annotation mode.
document:
The document to which the tag will be added.
typeId:
The id for element type.
ownerDBViewId:
The view in which the tag will be visible.
reference:
The host reference of the tag. The reference must be local to an element or subelement.
pnt:
The position of the tag
angle:
The angle of the tag
Returns:
If successful the new tag is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId ownerDBViewId does not correspond to a View.
-or-
The ElementId ownerDBViewId is a view template.
-or-
The ElementId ownerDBViewId is a perspective view.
-or-
The 3D view ownerDBViewId is not locked.
-or-
Invalid ElementType Id.
-or-
Invalid reference.
-or-
Linked reference is not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InternalException:
Tag creation failed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.IndependentTag.SetIsLeaderVisible(Autodesk.Revit.DB.Reference,System.Boolean)
Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
referenceTagged:
The reference which is tagged.
visible:
True for showing the leader, false to hide it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
The LeadersPresentationMode should be set to ShowSpecificLeaders.
Since:
2023

Autodesk.Revit.DB.IndependentTag.IsLeaderVisible(Autodesk.Revit.DB.Reference)
Returns if leader that points to specified reference is visible or not.
referenceTagged:
The reference which is tagged.
Returns:
Returns true if leader that points to specified reference is visible, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2023

Autodesk.Revit.DB.IndependentTag.GetTaggedReferences
Get the host references of the tag.
An array of all the tagged references.
Remarks:
The references can be to an element or subelement in a local or linked document.
Since:
2022

Autodesk.Revit.DB.IndependentTag.IsTaggedOnSubelement
Returns true if the any of the tagged references is a subelement.
Since:
2018

Autodesk.Revit.DB.IndependentTag.GetTaggedLocalElements
Get the tagged local elements, if any.
An Element will be provided for each subelement that is being referenced by the tag.
Returns:
All tagged elements from the local document, or null for orphan tags and tagged elements in linked documents.
Since:
2022

Autodesk.Revit.DB.IndependentTag.RemoveReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Removes the provided list of references from the tag's list of references.
referencesToRemove:
References to be removed from tag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all tagged before removing them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.AddReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds the provided list of references to the tag's list of references.
Remarks:
The references must pass the following requirements to be added:
Must not be already tagged.Must be of the same category when TagMode is TM_ADDBY_CATEGORY.Must be taggable by this tag type.
If any of the above rules is not fulfilled, the execution will be stopped and an exception will be thrown
referencesToTag:
References to be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all taggable and that they are not already tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
This type of tag does not support multiple references.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderEnd(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
pointEnd:
Point representing the end position of tag's leader
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderEnd(Autodesk.Revit.DB.Reference)
Returns the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
Returns:
Point representing the end position of tag's leader
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderElbow(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the position of the elbow of the tag's leader that points to specified reference.
If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
elbowPosition:
The position of the elbow.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
-or-
The leader for the tagged reference isn't visible.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderElbow(Autodesk.Revit.DB.Reference)
Returns the position of the elbow of the tag's leader that points to specified reference.
Position of leader's elbow.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference does not have a leader or its leader is straight.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.HasLeaderElbow(Autodesk.Revit.DB.Reference)
Whether the tag's leader that points to the reference has an elbow point or not.
Returns:
True if the reference has a leader with an elbow point, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
-or-
The leader for the tagged reference isn't visible.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetTaggedElementIds
Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each
subelement that is being referenced by the tag.
Remarks:
All the returned LinkElementIds will be valid even when Autodesk.Revit.DB.IndependentTag.IsOrphaned is true.
Returns:
Set of all the tagged elements ids for both local and linked files.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetTaggedLocalElementIds
Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each
subelement that is being referenced by the tag.
Set of all the element ids in the local file.
For each subelement a local element id will be provided.
Since:
2022

Autodesk.Revit.DB.IndependentTag.HasTagBehavior
Checks if the IndependentTag has a tag behavior.
Remarks:
When the IndependentTag object does not have a tag behavior, functions related to references, leaders and orientation will throw an exception.
In this case, the element may be used for geometry augmentation. Autodesk::Revit::Proxy::DB::IGeometryAugmentationServer
The list of functions that would fail if not in tag mode:
Autodesk.Revit.DB.IndependentTag.AddReferences(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Reference})Autodesk.Revit.DB.IndependentTag.GetLeaderElbow(Autodesk.Revit.DB.Reference)Autodesk.Revit.DB.IndependentTag.GetLeaderEnd(Autodesk.Revit.DB.Reference)Autodesk.Revit.DB.IndependentTag.HasLeaderAutodesk.Revit.DB.IndependentTag.HasLeaderElbow(Autodesk.Revit.DB.Reference)Autodesk.Revit.DB.IndependentTag.IsLeaderVisible(Autodesk.Revit.DB.Reference)Autodesk.Revit.DB.IndependentTag.LeaderEndConditionAutodesk.Revit.DB.IndependentTag.LeadersPresentationModeAutodesk.Revit.DB.IndependentTag.MergeElbowsAutodesk.Revit.DB.IndependentTag.RemoveReferences(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Reference})Autodesk.Revit.DB.IndependentTag.SetIsLeaderVisible(Autodesk.Revit.DB.Reference,System.Boolean)Autodesk.Revit.DB.IndependentTag.SetLeaderEnd(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)Autodesk.Revit.DB.IndependentTag.SetLeaderElbow(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)Autodesk.Revit.DB.IndependentTag.TagOrientationAutodesk.Revit.DB.IndependentTag.TagText
Since:
2024

Autodesk.Revit.DB.IndependentTag.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Reference,System.Boolean,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.XYZ)
Places a tag on an element or subelement.
document:
The document to which the tag will be added.
symId:
The id for the FamilySymbol which determines the tag's type.
ownerDBViewId:
The view in which the tag will be visible.
referenceToTag:
The host reference of the tag. The reference can be to an element or subelement in a local or linked document.
addLeader:
When true, the tag will be created with a straight leader with an attached end.
tagOrientation:
The orientation of the tag's head.
pnt:
For tags without leaders, this point is the position of the tag head.
For tags with leaders, this point is the end point of the leader,
and a leader of default length will be created from this point to the tag head.
Returns:
If successful the new tag is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId ownerDBViewId does not correspond to a View.
-or-
The ElementId ownerDBViewId is a view template.
-or-
The ElementId ownerDBViewId is a perspective view.
-or-
The 3D view ownerDBViewId is not locked.
-or-
The ElementId symId does not correspond to a FamilySymbol.
-or-
The reference can not be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InternalException:
Tag creation failed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.IndependentTag.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Reference,System.Boolean,Autodesk.Revit.DB.TagMode,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.XYZ)
Places a tag on an element or subelement.
Remarks:
Single category tags, multi-category tags and material tags can be placed.
document:
The document to which the tag will be added.
ownerDBViewId:
The view in which the tag will be visible.
referenceToTag:
The host reference of the tag. The reference can be to an element or subelement in a local or linked document.
addLeader:
When true, the tag will be created with a straight leader with an attached end.
tagMode:
This argument determines the type of tag that will be created. Tag by category, multi-category tag, and material tag are allowed.
tagOrientation:
The orientation of the tag's head.
pnt:
For tags without leaders, this point is the position of the tag head.
For tags with leaders, this point is the end point of the leader, and a leader of default length will be created from this point to the tag head.
Returns:
If successful the new tag is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId ownerDBViewId does not correspond to a View.
-or-
The ElementId ownerDBViewId is a view template.
-or-
The ElementId ownerDBViewId is a perspective view.
-or-
The 3D view ownerDBViewId is not locked.
-or-
The reference can not be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InternalException:
Tag creation failed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no loaded tag type that can be used when tagging referenceToTag with tagMode.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.IndependentTag.MergeElbows
Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
When setting this property: For this tag leaders are not allowed.
-or-
When setting this property: Can't merge elbows for tags that are part of a multi-reference annotation.
Since:
2023

Autodesk.Revit.DB.IndependentTag.LeadersPresentationMode
Identifies the Presentation Mode that is applied to tag leaders.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The LeadersPresentationMode LeadersPresentationMode.ShowOnlyOne or LeadersPresentationMode.ShowSpecificLeaders can't be set to a tag with only one leader.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
When setting this property: For this tag leaders are not allowed.
Since:
2023

Autodesk.Revit.DB.IndependentTag.RotationAngle
The rotation angle of the tag relative to its view
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Angle can only be changed for AnyModelDirection orientation
Since:
2022

Autodesk.Revit.DB.IndependentTag.MultiLeader
Returns if the tag if referencing multiple elements and/or sub-elements.
Since:
2022

Autodesk.Revit.DB.IndependentTag.LeaderEndCondition
The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
Remarks:
Autodesk.Revit.DB.LeaderEndCondition enumerates the supported leader end conditions.
Material tags and material keynotes can only use the free end condition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: LeaderEndCondition cannot be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.

Autodesk.Revit.DB.IndependentTag.HasLeader
Identifies if a tag has at least one visible leader, or if all leaders are hidden.
True if at least one leader is visible, false if all leaders are hidden. Setting the property to true, it will make all leaders visible.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The IndependentTag object does not have a tag behavior.
-or-
When setting this property: For this tag leaders are not allowed.

Autodesk.Revit.DB.IndependentTag.TagHeadPosition
The position of the head of tag in model coordinates.
Remarks:
The depth of the tag head position in the view does not matter
because tags are drawn over model geometry in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.IndependentTag.TagOrientation
The tag orientation of the tag's head, such as horizontal or vertical.
Remarks:
Autodesk.Revit.DB.TagOrientation for the supported orientations.
Tags from types that have rotate with component turned on ignore the TagOrientation property.
Tags that are not in tag mode ignores the TagOrientation property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.IsOrphaned
Identifies if the tag is orphaned or not.
Remarks:
Orphaned tags are those tags that are associated with one or more linked host that is missing.
Tags become orphaned when one or more associated linked host is missing from the link.

Autodesk.Revit.DB.IndependentTag.TagText
The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
The tagging element is in the link.